hour_values = {
    0: ["ноль", "двенадцатого"],
    1: ["час", "первого"],
    2: ["два", "второго"],
    3: ["три", "третьего"],
    4: ["четыре", "четвёртого"],
    5: ["пять", "пятого"],
    6: ["шесть", "шестого"],
    7: ["семь", "седьмого"],
    8: ["восемь", "восьмого"],
    9: ["девять", "девятого"],
    10: ["десять", "десятого"],
    11: ["одинадцать", "одинадцатого"],
    12: ["двенадцать", "двенадцатого"],
}

minutes_values = {
    1: ["одна", "одной"],
    2: ["две", "двух"],
    3: ["три", "трёх"],
    4: ["четыре", "четырёх"],
    5: ["пять", "пяти"],
    6: ["шесть", "шести"],
    7: ["семь", "семи"],
    8: ["восемь", "восьми"],
    9: ["девять", "девяти"],
    10: ["десять", "десяти"],
    11: ["одинадцать", "одиндцати"],
    12: ["двенадцать", "двенадцати"],
    13: ["тринадцать", "тринадцати"],
    14: ["четырнадцать", "четырнадцати"],
    15: ["пятнадцать", "пятнадцати"],
    16: ["шестнадцать", "шестнадцати"],
    17: ["семнадцать", "семнадцати"],
    18: ["восемнадцать", "восемнадцати"],
    19: ["девятнадцать", "девятнадцати"],
    20: ["двадцать", "двадцати"],
    30: ["тридцать", "тридцати"],
}

minutes_tokens = ("минута", "минуты", "минут")

special_minutes_tokens = {
    0: "ровно",
    30: "половина"
}
