from datetime import datetime
import datetime 

date_time = datetime.datetime.now()
#time = date_time.time()

choice_time = input("If you want to enter the time manually, select <1>. If you enter the current time, select <2> ")
if choice_time == "1":
    user_time = input("Enter time (hh:mm): ")
    time_h, time_m = user_time.split(':') 
elif choice_time == "2":
    choice_time = print(date_time.strftime('%H:%M'))
    time_h = date_time.strftime('%H')
    time_m = date_time.strftime('%M')
else:
    print('Not correct')

minuts = {0:("ноль часов","","ровно"),
1:("один час","первого","одна минута"),
2:("два часа","второго","две минуты"),
3:("три часа","третьего","три минуты"),
4:("четыре часа","четвертого","четыре минуты"),
5:("пять часов","пятого","пять минут"),
6:("шесть часов","шестого","шесть минут"),
7:("семь часов","седьмого","семь минут",),
8:("восемь часов","восьмого","восемь минут"),
9:("девять часов","девятого","девять минут"),
10:("десять часов","десятого","десять минут"),
11:("одиннадцать часов","одиннадцатого","одиннадцать минут"),
12:("двенадцать часов","двенадцатого","двенадцать минут"),
13:("один час","первого","тринадцать минут"),
14:("два часа","второго","чертырнадцать минут"),
15:("три часа","третьего","пятнадцать минут"),
16:("четыре часа","четвертого","шестнадцать минут"),
17:("пять часов","пятого","семнадцать минут"),
18:("шесть часов","шестого","восемнадцать минут"),
19:("семь часов","седьмого","девятнадцать минут"),
20:("восемь часов","восьмого","двадцать минут"),
21:("девять часов","девятого","двадцать одна минута"),
22:("десять часов","десятого","двадцать две минуты"),
23:("одиннадцать часов","одиннадцатого","двадцать три минуты"),
24:("двенадцать часов","двенадцатого","двадцать четыре минуты"),
25:("","","двадцать пять минут"), 26:("","","двадцать шесть минут"),
27:("","","двадцать семь минут"), 28:("","","двадцать восемь минут"),
29:("","","двадцать девять минут"), 30:("половина"),
31:("тридцать одна минута"), 32:("тридцать две минуты"),
33:("тридцать три минуты"), 34:("тридцать четыре минуты"),
35:("тридцать пять минут"), 36:("тридцать шесть минут"),
37:("тридцать семь минут"), 38:("тридцать восемь минут"),
39:("тридцать девять минут"),40:("сорок минут"), 41:("сорок одна минута"),
42:("сорок две минуты"),43:("сорок три минуты"), 44:("сорок четыре минуты"),
45:("без пятнадцати минут"), 46:("без четырнадцати минут"), 47:("без тринадцати минут"),
48:("без двенадцати минут"), 49:("без одиннадцати минут"), 50:("без десяти минут"),
51:("без девяти минут"), 52:("без восьми минут"), 53:("без семи минут"),
54:("без шести минут"), 55:("без пяти минут"), 56:("без четырех минут"),
57:("без трех минут"), 58:("без двух минут"), 59:("без одной минуты")}

time_h = int(time_h)
time_m = int(time_m)

if time_m < 30 and time_m != 0 :
    print(f"{minuts[time_m][2]} {minuts[time_h+1][1]}")
if time_m == 30 or (time_m > 30 and time_m < 45):
    print(f"{minuts[time_m]} {minuts[time_h+1][1]}")
if time_m >= 45:
    #print(f"{minuts[time_m]} {minuts[time_h+1][0]}")
    time_1,time_2 = minuts[time_h+1][0].split()
    print(f"{minuts[time_m]} {time_1}")
if time_m == 0:
    print(f"{minuts[time_m][2]} {minuts[time_h][0]}")
