import datetime
db={1:("одна минута", "второго", "одной", "первый", "два"),2:("двe минуты", "третьего", "двух", "второй", "три"),3:("три минуты", "четвертого", "трех", "третий", "четыре"),
4:("четыре минуты", "пятого", "четырех", "четвертый", "пять"),5:("пять минут", "шестого", "пяти", "пятый", "шесть"),6:("шесть минут", "седьмого", "шести", "шестой", "семь"),7:("семь минут", "восьмого", "семи", "седьмой", "восемь"),8:("восемь минут", "девятого", "восьми", "восьмой", "девять"),9:("девять минут", "десятого", "девяти", "девятый", "десять"),
10:("десять минут", "одинадцатого", "десяти", "десятый", "одинацать"),11:("одиннадцать минут", "двенадцатого", "одинадцати", "одинадцатый", "двенадцать"),12:("двенадцать минут", "первого", "двенадцати", "двенадцатый", "час"),
13:("тринадцать минут", "второго", "тринадцати", "тринадцатый", "два"),14:("четырнадцать минут", "третьего", "четырнадцати", "четырнадцатый", "три"),15:("пятнадцать минут", "четвертого", "пятнадцати", "пятнадцатый", "четыре"),
16:("шестнадцать минут", "пятого", "шестнадцатый", "", "пять"),17:("семнадцать минут", "шестого", "", "семнадцатый", "шесть"),18:("восемнадцать минут", "седьмого", "", "восемнадцатый", "семь"),
19:("девятнадцать минут", "восьмого", "", "девятнадцатый", "восемь"),20:("двадцать минут", "девятого", "", "двадцатый", "девять"),21:("двадцать одина минута", "десятого", "", "двадцать первый", "десять"),
22:("двадцать две минуты", "одиннадцатого", "", "двадцать второй", "одинадцать"),23:("двадцать три минуты", "двенадцатого", "", "двадцать третий", "двенадцать"),24:("двадцать четыре минуты", "первого", "", "двадцать четвертый", "час"),25:("двадцать пять минут"),26:("двадцать шесть минут"),
27:("двадцать семь минут"),28:("двадцать восемь минут"),29:("двадцать девять минут"),30:("тридцать"),31:("тридцать одна минута"),32:"тридцать две минуты",33:"тридцать три минуты",34:"тридцать четыре минуты",35:"тридцать пять минут",36:"тридцать шесть минут",
37:"тридцать семь минут",38:"тридцать восемь минут",39:"тридцать девять минут",40:"сорок минут",41:"сорок одна минута",42:"сорок две минуты",43:"сорок три минуты",44:"сорок четырые минуты",45:"сорок пять ",46:"сорок шесть",
47:"сорок семь",48:"сорок восемь ",49:"сорок девять ",50:"пятьдесят",51:"пятьдесят один",52:"пятьдесят два",53:"пятьдесят три",54:"пятьдесят четыре ",55:"пятьдесят пять",
56:"пятьдесят шесть",57:"пятьдесят семь",58:"пятьдесят восемь",59:"пятьдесят девять", 0:("двадцать четыре минуты", "первого", "", "двадцать четвертый", "час")}
x=datetime.datetime.now()
min=datetime.datetime.today().minute
hour=datetime.datetime.today().hour
choise=input("Введите Yes , если хотите ввести время или NO,если время текущее ")
if choise.lower()=="yes":
    person_time=datetime.datetime.strptime(input('Time: '), "%H:%M")
    min_current=person_time.minute
    hour_current=person_time.hour
    if min_current == 0 :
        if hour_current in db:
            print (f"{db[hour_current][3]} час")
    elif min_current<30:
        if min_current and hour_current in db:
            print(f"{db[min_current][0]} {db[hour_current][1]}")
    elif min_current==30:
        if hour_current in db:
            print(f"половина {db[hour_current][1]}")
    elif min_current>30 and min_current<45 :
        if min_current and hour_current in db:
            print(f"{db[min_current]}  {db[hour_current][1]}")    
    elif min_current>=45:
        if min_current and hour_current in db:
            print(f"без {db[60-min_current][2]} минут {db[hour_current][4]}")
    print(person_time.strftime("%H:%M"))
elif choise.lower()=="no": 
 
        if min == 0 :
            if hour in db:
                print (f"{db[hour][3]} час")
        elif min<30:
            if min and hour in db:
                print(f"{db[min][0]} {db[hour][1]}")
        elif min==30:
            if hour in db:
                print(f"половина {db[hour][1]}")
        elif min>30 and min<45 :
            if min and hour in db:
                print(f"{db[min]}  {db[hour][1]}")    
        elif min>=45:
            if min and hour in db:
                print(f"без {db[60-min][2]} минут {db[hour][4]}")
        print (x.strftime("%H:%M"))